This form cannot be created due to self-intersecting geometry. Clicking the Reset Connections button will attempt to solve this problem.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FormElemRegenSelfIntersectionResetConnections { get; }
  Visual Basic
Public Shared ReadOnly Property FormElemRegenSelfIntersectionResetConnections As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FormElemRegenSelfIntersectionResetConnections {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FormFailures Class
  Autodesk.Revit.DB Namespace